[
  "CURRENT ROLE / NOW\nI'm currently working as an AI/ML (GenAI) Intern at Techlusion. I joined on July 21, 2025. Onsite role based in Ahmedabad, Gujarat, India.\nIf someone asks “What are you doing now?” or “current role,” answer exactly this.",
  "PANKIT SHAH\nAI/ML ENGINEER\n\n+91 7229013335\n\npankitshah493@gmail.com\n\nPankit Shah\n\nMy Github\n\nMy Portfolio\n\nEDUCATION\nGujarat Technological University\nB.E. (Hons.) in Computer Engineering With Specialization in Data Science\nCGPA: 9.00\n\n(May 2021 – May 2025)\nAhmedabad,Gujarat,India\n\nEXPERIENCE\nTechlusion\n\n(July 2025 – Present)\nOnsite ( Ahmedabad,Gujarat,India )\n\nArtificial Intelligence Intern (GenAI)\n\nDeveloped an AI-powered Liquor Detection System to identify alcohol levels from bottle images using FCN and YOLO models. Trained and fine-tuned on 5,000+ annotated images via LabelMe, the system achieved 90–95% accuracy with an average response time under 10 seconds per image upload.\nBuilt an Intelligent HR Screening System that parsed applicant emails, matched roles with JDs, and scored candidates through semantic claim validation instead of keyword matching for precise shortlisting.\nCreated an Agentic Workflow Platform using Claude and MCP servers to convert templates into fully functional, client-tailored websites, automating color, layout, and content customization.\nDeep Learning Titans\n\n(Jan 2025 - March 2025)\nRemote ( Ahmedabad,Gujarat,India )\n\nArtificial Intelligence Intern\n\nDeveloped an AI-powered system for blockchain market analysis, tracking top investors' trades and\npredicting token sentiment using LLM-based sentiment analysis.\nImplemented data scraping and sentiment evaluation by leveraging Selenium, JavaScript, and Twitter\ndata to analyze influential market participants’ sentiments and trading behaviors.\nFine-tuned a Large Language Model (LLM) using Hugging Face to enhance sentiment accuracy,\nintegrating insights into a client-side API for informed trading decisions.\nLintel Technologies Pvt. Ltd.\n\n(Oct 2024 – Dec 2024)\n\nAI/ML Intern\n\nAhmedabad,Gujarat,India\nDeveloped a robust speech-to-text system using state-of-the-art ASR models to transcribe customer\nservice calls with high accuracy.\nDesigned and implemented a structured database solution to efficiently store and manage both audio\nrecordings and their corresponding transcriptions.\nCreated an NLP pipeline to automatically extract relevant details, user intents, and key information\nfrom transcribed conversations.\nIntegrated a transformer-based summarization model to generate brief, informative summaries of\neach call for streamlined client insights.\n(Aug 2024 – Oct 2024)\nAhmedabad,Gujarat,India\n\nFx is AI\nMachine Learning Intern\n\nBuilt a chatbot for the client based on the U.S. legal system using RAG pipelines, Qdrant, Docker, and\nAWS tools.\nDesigned a dual-interface: a user-side chatbot for retrieving legal documents and queries, and a\nadmin-side dashboard for document uploads and chatbot management.\nEnabled chatbot-generated legal documents like FIRs and agreements and integrated robust error\nhandling.\nOptimized retrieval accuracy while ensuring compliance with U.S. legal frameworks.\nSmapca Pvt. Ltd. & Cognian (SAL College)\n\n(Dec 2023– Feb 2024)\n\nMachine Learning Research Intern\n\nAhmedabad,Gujarat,India\nCreated a smart shopping cart system using VGG16 to detect and display items placed in the cart.\nDeveloped a dual-interface: an admin panel for product database management and a user interface\nwith Razorpay integration for seamless checkout.\nWorked on hardware implementation using Raspberry Pi and display for a functional end-to-end\nprototype.\nTrained the model with 10,000+ images, achieving 75%+ detection accuracy for grocery items.\n\n1\n\n\fTECHNICAL SKILLS\nLanguages: Python, SQL, C, JavaScript.\nLibraries & ML Frameworks: TensorFlow, PyTorch, Scikit-learn, XGBoost, Transformers, Pandas, NumPy,\nOpenCV, FinBERT, NLTK.\nFrameworks: Flask, FastAPI, Django\nNLP & LLMs: Hugging Face, RAG Pipelines, Tesseract OCR, Sentiment Analysis\nDatabases: MySQL, Redis, NoSQL\nTools & Platforms: Docker, GitHub, GitLab, Selenium, DBeaver CE, AWS (EC2, S3), Azure\n\nPROJECTS\nNewsSummarizerTTS | HuggingFace, LLM, Web Scraping, TTS | Github\n\n(April 2025)\n\nBuilt a web-based app to summarize company-related news and convert it to Hindi audio.\nUsed LLM to validate and correct user-input company names.\nScraped live news from a website and performed real-time summarization.\nIntegrated Hindi TTS model for generating audio from summarized output.\n(March 2025)\n\nNeuroScholar | Streamlit, HuggingFace, Groq, Qdrant, Tesseract OCR | Github\nBuilt an AI-powered RAG chatbot for extracting knowledge from PDFs.\nUsed Streamlit for UI, Qdrant for vector search, and Groq LLM for responses.\nIntegrated OCR (Tesseract, PyMuPDF) for scanned documents.\nOptimized retrieval with semantic search & context-aware querying.\nLaptop Price Predictor | Flask, HTML, CSS | Github\n\n(May 2024)\n\nDeveloped a full-stack application using Flask, HTML, and CSS to predict laptop prices based on input\nparameters.\nImplemented regression algorithms for price prediction, achieving high model accuracy.\nDesigned an intuitive user interface for seamless interaction and data input.\nOptimized the backend to process predictions efficiently and ensure reliable performance.\nChatbot for Rajkot Municipal Corporation | Dialogflow, FastAPI, MySQL | Github\n\n(Dec 2023)\n\nIncorporated Dialogflow’s NLP and Intent Classification for efficient user interactions.\nEmployed FastAPI Python backend for seamless functionality.\nCrafted intuitive frontend using HTML/CSS for optimal user experience.\n\nCOURSE CERTIFICATIONS\nMachine Learning Specialization\n\nNov 2023 - Apr 2024\n\nOffered by Stanford Online & DeepLearning.ai on Coursera\n\nGenerative AI for Everyone\n\nDec 2023 - Dec 2023\n\nOffered by Stanford Online & DeepLearning.ai on Coursera\n\n2",
  "Project: AI News Summarizer TTS\nDescription: A sleek Streamlit app that auto-corrects company names, scrapes and summarizes the latest news, then speaks it out in Hindi via TTS.\nGitHub Link: https://github.com/Shah-Pankit/News_Summarizer_TTS",
  "Project: Fake News Classifier\nDescription: LSTM-based deep learning model that detects fake news by analyzing article text, using the Kaggle Fake News dataset for training and evaluation.\nGitHub Link: https://github.com/Shah-Pankit/Kaggle-Faker-News-Classification-using-DL",
  "Project: Sentiment Analyzer\nDescription: A Sentiment classification system using NLTK to categorize user comments into positive, neutral, or negative classes via natural language processing.\nGitHub Link: https://github.com/Shah-Pankit/NPN-Sentiment-analysis-using-NLP",
  "Project: Spam Classifier\nDescription: An NLP-based system using NLTK and Bag-of-Words to classify text messages as Spam or Ham.\nGitHub Link: https://github.com/Shah-Pankit/SpamClassifier-using-Python-NLP-Project1-Full",
  "Project: Laptop Price Predictor\nDescription: Predicts the estimate price of any laptop based on input parameters like size of RAM, CPU type, GPU type, etc.\nGitHub Link: https://github.com/Shah-Pankit/Laptop-Price-Predictor",
  "Project: AI Lead Intent Scorer\nDescription: An AI-powered tool that automatically analyzes and scores lead intent, helping businesses prioritize high-quality prospects with data-driven insights.\nGitHub Link: https://github.com/Shah-Pankit/AI-Lead-Intent-Score",
  "Project: NeuroScholar\nDescription: NeuroScholar is an AI-powered assistant that lets you chat with your PDFs and instantly extract insights, summaries, and answers from academic papers.\nGitHub Link: https://github.com/Shah-Pankit/NeuroScholar",
  "Project: AI Audio Control\nDescription: Hand gesture-based system volume controller using computer vision and real-time hand tracking with OpenCV and MediaPipe.\nGitHub Link: https://github.com/Shah-Pankit/ai-volume-controller",
  "Project: Chatbot for RMC\nDescription: An AI-powered chatbot that instantly answers user questions by extracting information from the Rajkot Municipal Corporation website.\nGitHub Link: https://github.com/Shah-Pankit/Chatbot-for-RMC",
  "Artificial Intelligence Intern at Deep Learning Titans (Jan 2025 - Mar 2025): Developed an AI-powered system for blockchain market analysis, tracking top investors' trades and predicting token sentiment using LLM-based sentiment analysis. Used Selenium, JavaScript, and Twitter data for scraping, and fine-tuned an LLM via Hugging Face. Results were integrated into a client-side API for smart trading insights.",
  "AI/ML Intern at Lintel Technologies Pvt. Ltd. (Oct 2024 - Dec 2024): Built a speech-to-text system using ASR models to transcribe customer service calls. Created a structured database for audio & transcripts, NLP pipeline for extracting key info, and transformer-based summarization for call insights.",
  "Machine Learning Intern at Fx is AI (Aug 2024 - Oct 2024): Built a legal chatbot using RAG pipelines, Qdrant, Docker, and AWS. Developed user and admin interfaces, document upload and retrieval logic, and enabled chatbot to generate FIRs and agreements. Ensured retrieval accuracy and U.S. legal compliance.",
  "Machine Learning Research Intern at Smapca Pvt. Ltd. & Cognian (SAL College) (Dec 2023 - Feb 2024): Created a smart shopping cart using VGG16 for grocery detection, admin panel for database, user UI with Razorpay checkout, Raspberry Pi integration, and achieved 75%+ accuracy over 10K+ images.",
  "AI/ML (GenAI) Intern at Techlusion (Jul 2025 - Present): Joined on July 21, 2025."
]